Documents/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Заявки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепленныеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОбщийЗаявки/Ext/Module.bsl
Функция ПреобразоватьТекстЗаявки(ТекстЗаявки) Экспорт	
	НайтиКомНач = Найти(ТекстЗаявки,"<!--");
	НайтиКомКон = Найти(ТекстЗаявки, "-->");	
	Пока НайтиКомНач <> 0 ИЛИ НайтиКомКон <> 0 Цикл 
		ТекстЗаявки = СокрЛП(Лев(ТекстЗаявки,НайтиКомНач-1)) + СокрЛП(Прав(ТекстЗаявки, СтрДлина(ТекстЗаявки) - НайтиКомКон-2));
		НайтиКомНач = Найти(ТекстЗаявки,"<!--");
		НайтиКомКон = Найти(ТекстЗаявки, "-->");	
	КонецЦикла;
	Возврат СтрЗаменить(ТекстЗаявки, "<meta http-equiv=""Content-Type"" content=""text/html; charset=koi8-r"">","<meta charset=""utf-8"">");	
КонецФункции

Функция ПреобразоватьТемуЗаявки(ТемаЗаявки) Экспорт
	Возврат СтрЗаменить(ТемаЗаявки, "FW:", "");
КонецФункции

Функция НайтиИнициатораЗаявки(ТекстЗаявки) Экспорт
	Замена = "From:</span></b><span style=""mso-fareast-language:RU"">";
	левИнициатор = Найти(ТекстЗаявки,Замена);
	правИнициатор = Прав(ТекстЗаявки, СтрДлина(ТекстЗаявки)-левИнициатор+1);
	br = Найти(правИнициатор, "<br>");
	Инициатор = СокрЛП(СтрЗаменить(Лев(правИнициатор,br-1),Замена,""));
	спрИнициатор = Справочники.Пользователи.НайтиПоНаименованию(Инициатор);
	Если спрИнициатор = Справочники.Пользователи.ПустаяСсылка() Тогда 
		спрИнициатор = СоздатьПользователя(Инициатор);	
	КонецЕсли;
	Возврат спрИнициатор;	
КонецФункции

Функция СоздатьПользователя(ФИО) Экспорт
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = ФИО;
	НовыйПользователь.Записать();
	Возврат НовыйПользователь;
КонецФункции

Функция ПолучитьПоследнююПриоритет() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Заявки.Приоритет КАК Приоритет
		|ИЗ
		|	Документ.Заявки КАК Заявки
		|ГДЕ
		|	Заявки.Приоритет <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.Приоритет;		
		КонецЕсли;
	КонецЕсли;
КонецФункции
